package com.atguigu.scala.chapter02

/**
  * Author: Felix
  * Date: 2020/6/29
  * Desc: 数据类型  --强制类型转换面试题
  *  Int: 128
  *  源码：   00000000  00000000  00000000  10000000
  *   //正数源码、反码、补码一样
  *  截取-->Byte
  *     10000000 补码   10000000是当前范围负数的最小值，约定为-128
  * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  * Int :130
  *   源码：   00000000  00000000  00000000  10000010
  * 截取-->Byte
  *   10000010(补码)==>11111101(反码)==>11111110(源码)
  *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  * Int :-130
  *   源码：   10000000  00000000  00000000  10000010
  *   反码：   11111111  11111111  11111111  01111101
  *   补码：   11111111  11111111  11111111  01111110
  * 截取-->Byte
  *   01111110(补码)==>源码和补码一样，也是01111110
  *
  */
object Scala07_TestType {
  def main(args: Array[String]): Unit = {

    var b:Byte = (-130).toByte

    println(b)
  }
}
